In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','potter','spiderman'],
    "marks":['12','13','14'],
    "city":['rampur','kolkata']
}

In [4]:
dict1 = {
    "name":['harry','potter','spiderman'],
    "marks":['12','13','14'],
    "city":['rampur','kolkata','varanasi']
}

In [5]:
pd.DataFrame(dict1)

        name marks      city
0      harry    12    rampur
1     potter    13   kolkata
2  spiderman    14  varanasi

In [6]:
df.to_csv('friends.csv')

NameError: name 'df' is not defined

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

        name marks      city
0      harry    12    rampur
1     potter    13   kolkata
2  spiderman    14  varanasi

In [9]:
df.to_csv('friends.csv')

In [10]:
df.to_csv('friends_index_false.csv',index = False)

In [11]:
df.head(2)

     name marks     city
0   harry    12   rampur
1  potter    13  kolkata

In [12]:
df.tail(2)

        name marks      city
1     potter    13   kolkata
2  spiderman    14  varanasi

In [13]:
df.describe()

         name marks    city
count       3     3       3
unique      3     3       3
top     harry    12  rampur
freq        1     1       1

In [14]:
ali = pd.read_csv('friends.csv')

In [15]:
ali

   Unnamed: 0       name  marks      city
0           0      harry     12    rampur
1           1     potter     13   kolkata
2           2  spiderman     14  varanasi

In [16]:
ali['marks']

0    12
1    13
2    14
Name: marks, dtype: int64

In [17]:
ali['marks'][0]

12

In [18]:
ali['marks'][0] = 11

C:\Users\Lenovo\AppData\Local\Temp/ipykernel_18324/1057649099.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ali['marks'][0] = 11

In [19]:
ali

   Unnamed: 0       name  marks      city
0           0      harry     11    rampur
1           1     potter     13   kolkata
2           2  spiderman     14  varanasi

In [20]:
ali.to_csv('ali.csv')

# changing index

In [21]:
ali.index = ['one','two','three']

In [22]:
ali

       Unnamed: 0       name  marks      city
one             0      harry     11    rampur
two             1     potter     13   kolkata
three           2  spiderman     14  varanasi

In [23]:
import pandas as pd
points_table = {'Team_':['MI', 'CSK', 'Devils', 'MI', 'CSK',
   'RCB', 'CSK', 'CSK', 'KKR', 'KKR', 'KKR', 'RCB'],
   'Rank_' :[1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year_' :[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Point_':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(points_table)

groupby_= df.groupby('Year_')
for team,group in groupby_:
   print(team)
   print(group)

2014
    Team_  Rank_  Year_  Point_
0      MI      1   2014     876
2  Devils      2   2014     863
4     CSK      3   2014     741
9     KKR      4   2014     701
2015
   Team_  Rank_  Year_  Point_
1    CSK      2   2015     789
3     MI      3   2015     673
5    RCB      4   2015     812
10   KKR      1   2015     804
2016
  Team_  Rank_  Year_  Point_
6   CSK      1   2016     756
8   KKR      2   2016     694
2017
   Team_  Rank_  Year_  Point_
7    CSK      1   2017     788
11   RCB      2   2017     690

In [24]:
print (groupby_.get_group(2014))

    Team_  Rank_  Year_  Point_
0      MI      1   2014     876
2  Devils      2   2014     863
4     CSK      3   2014     741
9     KKR      4   2014     701

In [25]:
import numpy as np
groupby_.get_group(2014).agg([np.mean,np.median,np.std,np.var ])

           Rank_   Year_       Point_
mean    2.500000  2014.0   795.250000
median  2.500000  2014.0   802.000000
std     1.290994     0.0    87.439026
var     1.666667     0.0  7645.583333

In [26]:
print("Maximum value : ",df.Point_.max())
print("Minimum value : ",df.Point_.min())

Maximum value :  876
Minimum value :  673

In [27]:
df.count()

Team_     12
Rank_     12
Year_     12
Point_    12
dtype: int64

In [28]:
pd.count

AttributeError: module 'pandas' has no attribute 'count'

In [29]:
df.Team_.value_counts()

CSK       4
KKR       3
MI        2
RCB       2
Devils    1
Name: Team_, dtype: int64

In [30]:
df.describe()

           Rank_        Year_      Point_
count  12.000000    12.000000   12.000000
mean    2.166667  2015.166667  765.583333
std     1.114641     1.114641   67.849376
min     1.000000  2014.000000  673.000000
25%     1.000000  2014.000000  699.250000
50%     2.000000  2015.000000  772.000000
75%     3.000000  2016.000000  806.000000
max     4.000000  2017.000000  876.000000

# Visualizations using Pandas Dataframe

In [32]:
df = pd.DataFrame({'col1':[1,2,3,4],
'col2':[444,555,666,444],
'col3':[‘abc’,’def’,’ghi’,’xyz’]})
df.head()

SyntaxError: invalid character '‘' (U+2018) (Temp/ipykernel_18324/3753507708.py, line 3)

In [34]:
df = pd.DataFrame({'col1':[1,2,3,4],
'col2':[444,555,666,444],
'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Finding Unique Values:

In [35]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [36]:
len(df['col2'].unique())

3

In [37]:
df['col2'].nunique()

3

# Conditional Selections

In [38]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [39]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

# Apply Method

In [40]:
df['col2].sum()

SyntaxError: unterminated string literal (detected at line 1) (Temp/ipykernel_18324/2652293411.py, line 1)

In [41]:
df['col2'].sum()

2109

In [42]:
def times2(x):
    return x*2

In [43]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

# lambda expression:

# Removing Columns

In [44]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [45]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

# Returning The Columns Name & Index Attributes

In [47]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [48]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [49]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [50]:
df.Index()

AttributeError: 'DataFrame' object has no attribute 'Index'

# Sorting & Ordering a DataFrame

In [51]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [52]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [53]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Booleans

In [54]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pivot Tables

In [55]:
data=pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
'B':['one','one','two','two','one', 'one'],
'C':['x','y','x','y','x','y'],
'D':[1,3,2,5,4,1]})
#data
df=pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [56]:
df.pivot_table(values='D', index=['A','B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN